postman/collections/45957668-a69989e1-9b31-457e-96ca-d8d2b9b96969.json

{
	"info": {
		"_postman_id": "204f46bd-1a1e-466d-903e-eeff152f0659",
		"name": "AOC-Zerodowntime",
		"description": "Proves de zero downtime a serveis de l'AOC.\n\nEs comproba que l'estat de les peticions no sigui cap estat invàlid.",
		"schema": "https://schema.getpostman.com/json/collection/v2.1.0/collection.json",
		"_exporter_id": "36473556"
	},
	"item": [
		{
			"name": "HubCarpetes",
			"item": [
				{
					"name": "HubCarpetes (backend)",
					"event": [
						{
							"listen": "test",
							"script": {
								"exec": [
									"pm.test(\"Status code is 200 or 404\", function () {\r",
									"  pm.expect([200, 404]).to.include(pm.response.code);\r",
									"});"
								],
								"type": "text/javascript",
								"packages": {}
							}
						}
					],
					"request": {
						"auth": {
							"type": "bearer",
							"bearer": [
								{
									"key": "token",
									"value": "{{HCC_JWT}}",
									"type": "string"
								}
							]
						},
						"method": "GET",
						"header": [],
						"url": {
							"raw": "https://hubcarpetes.aoc.cat/api/consultaActuacions?documentIdentificatiu=12345678A&tipusDocumentIdentificatiu=NIF",
							"protocol": "https",
							"host": [
								"hubcarpetes",
								"aoc",
								"cat"
							],
							"path": [
								"api",
								"consultaActuacions"
							],
							"query": [
								{
									"key": "documentIdentificatiu",
									"value": "12345678A"
								},
								{
									"key": "tipusDocumentIdentificatiu",
									"value": "NIF"
								}
							]
						}
					},
					"response": []
				},
				{
					"name": "HubCarpetes (web)",
					"event": [
						{
							"listen": "test",
							"script": {
								"exec": [
									"pm.test(\"Status code is 200 or 404\", function () {\r",
									"  pm.expect([200, 404]).to.include(pm.response.code);\r",
									"});\r",
									"\r",
									"const $ = cheerio.load(pm.response.text());\r",
									"const titleText = $('title').text();\r",
									"const expectedTitle = \"HCC Admin\"; // Replace with your expected title\r",
									"\r",
									"pm.test(\"HTML title check\", () => {\r",
									"  pm.expect(titleText).to.eql(expectedTitle);\r",
									"});"
								],
								"type": "text/javascript",
								"packages": {}
							}
						},
						{
							"listen": "prerequest",
							"script": {
								"packages": {},
								"type": "text/javascript"
							}
						}
					],
					"request": {
						"method": "GET",
						"header": [],
						"url": {
							"raw": "https://hubcarpetes.aoc.cat",
							"protocol": "https",
							"host": [
								"hubcarpetes",
								"aoc",
								"cat"
							]
						}
					},
					"response": []
				}
			]
		},
		{
			"name": "PSIS",
			"item": [
				{
					"name": "PSIS (validacio certificat)",
					"event": [
						{
							"listen": "test",
							"script": {
								"exec": [
									"pm.test(\"Status code is 200 or 404\", function () {\r",
									"  pm.expect([200, 404]).to.include(pm.response.code);\r",
									"});"
								],
								"type": "text/javascript",
								"packages": {}
							}
						}
					],
					"request": {
						"method": "POST",
						"header": [],
						"body": {
							"mode": "raw",
							"raw": "<soapenv:Envelope xmlns:soapenv=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n   <soapenv:Body>\r\n      <dss:VerifyRequest Profile=\"urn:oasis:names:tc:dss:1.0:profiles:XSS\" xmlns:dss=\"urn:oasis:names:tc:dss:1.0:core:schema\">\r\n        <dss:OptionalInputs>\r\n            <dss:VerificationTime>2024-10-17T12:43:14.000Z</dss:VerificationTime>\r\n         </dss:OptionalInputs>\r\n         <dss:SignatureObject>\r\n            <dss:Other>\r\n               <ds:X509Data xmlns:ds=\"http://www.w3.org/2000/09/xmldsig#\">\r\n                  <ds:X509Certificate>MIIHLjCCBhagAwIBAgIQctc6e0jbCDFHFvriljsPsjANBgkqhkiG9w0BAQsFADCB\r\niDELMAkGA1UEBhMCRVMxMzAxBgNVBAoMKkNPTlNPUkNJIEFETUlOSVNUUkFDSU8g\r\nT0JFUlRBIERFIENBVEFMVU5ZQTEqMCgGA1UECwwhU2VydmVpcyBQw7pibGljcyBk\r\nZSBDZXJ0aWZpY2FjacOzMRgwFgYDVQQDDA9FQy1TZWN0b3JQdWJsaWMwHhcNMjAx\r\nMTEzMTI0NzMxWhcNMjQxMTEzMTI0NzMxWjCCASgxCzAJBgNVBAYTAkVTMR8wHQYD\r\nVQQKDBZPcmdhbml0emFjacOzIGRlIHByb3ZhMRgwFgYDVQRhDA9WQVRFUy1RMDAw\r\nMDAwMEoxKjAoBgNVBAsMIVRyZWJhbGxhZG9yIHDDumJsaWMgZGUgbml2ZWxsIGFs\r\ndDEZMBcGA1UEDAwQQ8OgcnJlYyBkZSBwcm92YTEtMCsGA1UEBAwkZGUgbGEgUGXD\r\np2EgZGUgUHJvdmEgLSBETkkgMDAwMDAwMDBUMRAwDgYDVQQqDAdQZXJzb25hMRgw\r\nFgYDVQQFEw9JRENFUy0wMDAwMDAwMFQxPDA6BgNVBAMMM1BlcnNvbmEgZGUgbGEg\r\nUGXDp2EgZGUgUHJvdmEgLSBETkkgMDAwMDAwMDBUIChUQ0FUKTCCASIwDQYJKoZI\r\nhvcNAQEBBQADggEPADCCAQoCggEBAMq7NtNh4qIdxpmhj/S9Mkomiruby5TAj9Zo\r\n0BNZEr6zy+sohcP2WgEbJasxWg8DOFVmuuf30AKrAiC8pp70kAtML/WafXM3o1XY\r\njL6QWO4BycdKtM4pK0VdzxKCv7p4tbSRUVfoLcJO3MspQsjtb098/U8f0uixJEDs\r\natcRvS2cg7Z/0ldNIcuCnm+kLjHUeezkXk1Tx7MSF5WG7SLMGz2FNrHA9TIpe0MQ\r\nNcAeS2Rd/R1dCsvudb34OTPwmtc0tX/lMp2pBFX4ctnI0VVhFK8KeuiY1r/97dOp\r\nFqXaSEQNb0XPd28CGq7vfKZ9XyZmcndIHAnq00zCcBU0Ov5Or2MCAwEAAaOCAu8w\r\nggLrMAwGA1UdEwEB/wQCMAAwHwYDVR0jBBgwFoAURzzeFHe7ak9HkakC/9QG4XPc\r\n4tkwdgYIKwYBBQUHAQEEajBoMEEGCCsGAQUFBzAChjVodHRwOi8vd3d3LmNhdGNl\r\ncnQuY2F0L2Rlc2NhcnJlZ2EvZWMtc2VjdG9ycHVibGljLmNydDAjBggrBgEFBQcw\r\nAYYXaHR0cDovL29jc3AuY2F0Y2VydC5jYXQwMwYDVR0RBCwwKoELc2NkQGFvYy5j\r\nYXSgGwYKKwYBBAGCNxQCA6ANDAtzY2RAYW9jLmNhdDCB8wYDVR0gBIHrMIHoMIHa\r\nBgwrBgEEAfV4AQMCUgIwgckwMQYIKwYBBQUHAgEWJWh0dHBzOi8vd3d3LmFvYy5j\r\nYXQvQ0FUQ2VydC9SZWd1bGFjaW8wgZMGCCsGAQUFBwICMIGGDIGDQ2VydGlmaWNh\r\ndCBlbGVjdHLDsm5pYyBkZSB0cmViYWxsYWRvciBww7pibGljIGRlIG5pdmVsbCBh\r\nbHQuIEFkcmXDp2EgaSBOSUYgZGVsIHByZXN0YWRvcjogVmlhIExhaWV0YW5hIDI2\r\nIDA4MDAzIEJhcmNlbG9uYSBRMDgwMTE3NUEwCQYHBACL7EABAjApBgNVHSUEIjAg\r\nBggrBgEFBQcDAgYIKwYBBQUHAwQGCisGAQQBgjcUAgIwegYIKwYBBQUHAQMEbjBs\r\nMAgGBgQAjkYBATALBgYEAI5GAQMCAQ8wCAYGBACORgEEMBMGBgQAjkYBBjAJBgcE\r\nAI5GAQYBMDQGBgQAjkYBBTAqMCgWImh0dHBzOi8vd3d3LmFvYy5jYXQvY2F0Y2Vy\r\ndC9wZHNfZW4TAmVuMEEGA1UdHwQ6MDgwNqA0oDKGMGh0dHA6Ly9lcHNjZC5jYXRj\r\nZXJ0Lm5ldC9jcmwvZWMtc2VjdG9ycHVibGljLmNybDAdBgNVHQ4EFgQU64aS011c\r\nYvFk33ByNgXGzBRMMTswDgYDVR0PAQH/BAQDAgXgMA0GCSqGSIb3DQEBCwUAA4IB\r\nAQB82SiGZOQZzD7/GGRAmJrfjPUwQedNqn/C/F2Q9kF1+3i5FH5/o9/7DThrMGIh\r\nZpvW0ULe2uJgJvW7zef8GaUyrT/1l3CISMGNCY51886cSRkJkp34SXZP8TBItuJX\r\nY8GOkTYvgAWNmEHj1yTmU6ISI8GWgnyOUkz/71gKDIl9vnQB3RVpeRVo25cOMX1+\r\nVTLJf0C0E2VD/mPPsguTSsGTVe4wY5drAX+uA52oZnNvQHmlmYbue/ANAjbuJkmU\r\nC3VuxqDN3k2cvfOfxmr9eyNIhU/OurbqU76tKQIXdMaK3RKGTpqbb2o9ylmXAN3e\r\nYrK/OkrkaVsuSFsMAC1VBJ90</ds:X509Certificate>\r\n               </ds:X509Data>\r\n            </dss:Other>\r\n         </dss:SignatureObject>\r\n      </dss:VerifyRequest>\r\n   </soapenv:Body>\r\n</soapenv:Envelope>",
							"options": {
								"raw": {
									"language": "xml"
								}
							}
						},
						"url": {
							"raw": "{{PSIS_URL}}",
							"host": [
								"{{PSIS_URL}}"
							]
						}
					},
					"response": []
				}
			]
		},
		{
			"name": "VALID",
			"item": [
				{
					"name": "VALID",
					"event": [
						{
							"listen": "test",
							"script": {
								"exec": [
									"pm.test(\"Status code is 200 or 404\", function () {\r",
									"  pm.expect([200, 404]).to.include(pm.response.code);\r",
									"});"
								],
								"type": "text/javascript",
								"packages": {}
							}
						}
					],
					"request": {
						"method": "GET",
						"header": [],
						"url": {
							"raw": ""
						}
					},
					"response": []
				}
			]
		},
		{
			"name": "eNotum Backend",
			"item": [
				{
					"name": "eNotum Backend",
					"event": [
						{
							"listen": "test",
							"script": {
								"exec": [
									"pm.test(\"Status code is 200\", function () {\r",
									"  pm.response.to.have.status(200);\r",
									"});\r",
									"\r",
									"pm.test(\"Codi 1 es correspon amb Generalitat de Catalunya\", () => {\r",
									"  const responseJson = pm.response.json();\r",
									"  pm.expect(responseJson.nom).to.eql(\"Generalitat de Catalunya\");\r",
									"});"
								],
								"type": "text/javascript",
								"packages": {}
							}
						}
					],
					"request": {
						"method": "GET",
						"header": [],
						"url": {
							"raw": "http://enotum.int.aoc.cat:8083/api/organismes/1",
							"protocol": "http",
							"host": [
								"enotum",
								"int",
								"aoc",
								"cat"
							],
							"port": "8083",
							"path": [
								"api",
								"organismes",
								"1"
							]
						}
					},
					"response": []
				}
			]
		},
		{
			"name": "eNotum Ciutadania",
			"item": [
				{
					"name": "eNotum Ciutada API",
					"event": [
						{
							"listen": "test",
							"script": {
								"exec": [
									"pm.test(\"Status code is 200\", function () {\r",
									"  pm.response.to.have.status(200);\r",
									"});\r",
									"\r",
									"pm.test(\"Codi 1 es correspon amb Generalitat de Catalunya\", () => {\r",
									"  const responseJson = pm.response.json();\r",
									"  pm.expect(responseJson.nom).to.eql(\"Generalitat de Catalunya\");\r",
									"});"
								],
								"type": "text/javascript",
								"packages": {}
							}
						}
					],
					"request": {
						"method": "GET",
						"header": [],
						"url": {
							"raw": "https://api.enotum.cat/ciutadania/organismes/1",
							"protocol": "https",
							"host": [
								"api",
								"enotum",
								"cat"
							],
							"path": [
								"ciutadania",
								"organismes",
								"1"
							]
						}
					},
					"response": []
				},
				{
					"name": "eNotum Ciutada SPA",
					"event": [
						{
							"listen": "test",
							"script": {
								"exec": [
									"pm.test(\"Status code is 200\", function () {\r",
									"  pm.response.to.have.status(200);\r",
									"});\r",
									"\r",
									"pm.test(\"Validar contingut HTML\",() => {\r",
									"  pm.expect(pm.response.text()).to.include(\"<app-root></app-root>\");\r",
									"  pm.expect(pm.response.text()).to.include(\"<title>e-NOTUM</title>\");\r",
									"});"
								],
								"type": "text/javascript",
								"packages": {}
							}
						}
					],
					"request": {
						"method": "GET",
						"header": [],
						"url": {
							"raw": "https://usuari.enotum.cat/",
							"protocol": "https",
							"host": [
								"usuari",
								"enotum",
								"cat"
							],
							"path": [
								""
							]
						}
					},
					"response": []
				}
			]
		},
		{
			"name": "eNotum AAPP",
			"item": [
				{
					"name": "eNotum AAPP API",
					"event": [
						{
							"listen": "test",
							"script": {
								"exec": [
									"pm.test(\"Status code is 200\", function () {\r",
									"  pm.response.to.have.status(200);\r",
									"});\r",
									"\r",
									"pm.test(\"healthCheck status is UP\", () => {\r",
									"  const responseJson = pm.response.json();\r",
									"  pm.expect(responseJson.status).to.eql(\"UP\");\r",
									"});"
								],
								"type": "text/javascript",
								"packages": {}
							}
						}
					],
					"request": {
						"method": "GET",
						"header": [],
						"url": {
							"raw": "http://enotum.int.aoc.cat:8081/actuator/health",
							"protocol": "http",
							"host": [
								"enotum",
								"int",
								"aoc",
								"cat"
							],
							"port": "8081",
							"path": [
								"actuator",
								"health"
							]
						}
					},
					"response": []
				},
				{
					"name": "eNotum AAPP SPA",
					"event": [
						{
							"listen": "test",
							"script": {
								"exec": [
									"pm.test(\"Status code is 200\", function () {\r",
									"  pm.response.to.have.status(200);\r",
									"});\r",
									"\r",
									"pm.test(\"Validar contingut HTML\",() => {\r",
									"  pm.expect(pm.response.text()).to.include(\"<app-root></app-root>\");\r",
									"  pm.expect(pm.response.text()).to.include(\"<title>EACAT - ENOTUM</title>\");\r",
									"});"
								],
								"type": "text/javascript",
								"packages": {}
							}
						}
					],
					"request": {
						"method": "GET",
						"header": [],
						"url": {
							"raw": "https://eacat.enotum.cat",
							"protocol": "https",
							"host": [
								"eacat",
								"enotum",
								"cat"
							]
						}
					},
					"response": []
				}
			]
		},
		{
			"name": "iARXIU",
			"item": [
				{
					"name": "iARXIU (backend)",
					"event": [
						{
							"listen": "test",
							"script": {
								"exec": [
									"pm.test(\"Status code is 200\", function () {\r",
									"  pm.expect([200]).to.include(pm.response.code);\r",
									"});"
								],
								"type": "text/javascript",
								"packages": {}
							}
						}
					],
					"request": {
						"method": "GET",
						"header": [],
						"url": {
							"raw": "{{IARXIU_BACK_URL}}",
							"host": [
								"{{IARXIU_BACK_URL}}"
							]
						}
					},
					"response": []
				},
				{
					"name": "iARXIU (web)",
					"event": [
						{
							"listen": "test",
							"script": {
								"exec": [
									"pm.test(\"Status code is 200\", function () {\r",
									"  pm.expect([200]).to.include(pm.response.code);\r",
									"});"
								],
								"type": "text/javascript",
								"packages": {}
							}
						}
					],
					"request": {
						"method": "GET",
						"header": [],
						"url": {
							"raw": "{{IARXIU_FRONT_URL}}",
							"host": [
								"{{IARXIU_FRONT_URL}}"
							]
						}
					},
					"response": []
				}
			]
		},
		{
			"name": "Signasuite",
			"item": [
				{
					"name": "Signasuite",
					"event": [
						{
							"listen": "test",
							"script": {
								"exec": [
									"pm.test(\"Status code is 200 or 404\", function () {\r",
									"  pm.expect([200, 404]).to.include(pm.response.code);\r",
									"});"
								],
								"type": "text/javascript",
								"packages": {}
							}
						}
					],
					"request": {
						"method": "GET",
						"header": [],
						"url": {
							"raw": "{{SIGNASUITE_URL}}",
							"host": [
								"{{SIGNASUITE_URL}}"
							]
						}
					},
					"response": []
				}
			]
		}
	]
}